class Item {
  final String name;
  final String details;
  final String picture;
  final String address1;
  final String address2;
  final String address3;

  // Constructor that initializes all three properties
  Item(this.name, this.details, this.picture,this.address1,this.address2,this.address3);
}

// Sample data
List<Item> itemData = [
  Item('เสือคาบดาบ',
       'รายละเอียดเกี่ยวกับเสือคาบดาบ...',
       'assets/1st_home.png',
       '111/999 ม.2 ต.บางน่อ อ.บางบ่อ จ.สมุทรปราการ',
       '111/999 ม.2 ต.บางน่อ อ.บางบ่อ จ.สมุทรปราการ',
       '111/999 ม.2 ต.บางน่อ อ.บางบ่อ จ.สมุทรปราการ'),
  Item('พญาครุฑ', 'รายละเอียดเกี่ยวกับพญาครุฑ...', 'assets/garuda.png',
       '111/999 ม.2 ต.บางน่อ อ.บางบ่อ จ.สมุทรปราการ',
       '111/999 ม.2 ต.บางน่อ อ.บางบ่อ จ.สมุทรปราการ',
       '111/999 ม.2 ต.บางน่อ อ.บางบ่อ จ.สมุทรปราการ'),
  Item('พระรอด', 'รายละเอียดเกี่ยวกับพระรอด...', 'assets/buddha.png',
       '111/999 ม.2 ต.บางน่อ อ.บางบ่อ จ.สมุทรปราการ',
       '111/999 ม.2 ต.บางน่อ อ.บางบ่อ จ.สมุทรปราการ',
       '111/999 ม.2 ต.บางน่อ อ.บางบ่อ จ.สมุทรปราการ'),
  Item('ต้นมะพร้าว', 'รายละเอียดเกี่ยวกับต้นมะพร้าว...', 'assets/coconut_tree.png',
       '111/999 ม.2 ต.บางน่อ อ.บางบ่อ จ.สมุทรปราการ',
       '111/999 ม.2 ต.บางน่อ อ.บางบ่อ จ.สมุทรปราการ',
       '111/999 ม.2 ต.บางน่อ อ.บางบ่อ จ.สมุทรปราการ'),
  Item('ว่านมหาลาภ', 'รายละเอียดเกี่ยวกับว่านมหาลาภ...', 'assets/herb.png',
       '111/999 ม.2 ต.บางน่อ อ.บางบ่อ จ.สมุทรปราการ',
       '111/999 ม.2 ต.บางน่อ อ.บางบ่อ จ.สมุทรปราการ',
       '111/999 ม.2 ต.บางน่อ อ.บางบ่อ จ.สมุทรปราการ'),
  Item('ต้นโป๊ยเซียน', 'รายละเอียดเกี่ยวกับต้นโป๊ยเซียน...', 'assets/cactus.png',
       '111/999 ม.2 ต.บางน่อ อ.บางบ่อ จ.สมุทรปราการ',
       '111/999 ม.2 ต.บางน่อ อ.บางบ่อ จ.สมุทรปราการ',
       '111/999 ม.2 ต.บางน่อ อ.บางบ่อ จ.สมุทรปราการ'),
];
